---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.LayerId
source: html/7b6ace8a-7810-5e6d-760e-642361fbe916.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.LayerId Property

The id of the layer - note that this may be different from the index in the array of layers in a CompoundStructure.

## Syntax (C#)
```csharp
public int LayerId { get; }
```